tap "ariga/tap"
tap "charmbracelet/tap"
tap "daipeihust/tap"
tap "filosottile/musl-cross"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/services"
tap "localsend/localsend"
tap "messense/macos-cross-toolchains"
tap "tinygo-org/tools"
brew "libssh2"
brew "aria2"
brew "python@3.12"
brew "autojump"
brew "chezmoi"
brew "cmake"
brew "dos2unix"
brew "dust"
brew "efm-langserver"
brew "fastfetch"
brew "fd"
brew "pango"
brew "tesseract"
brew "ffmpegthumbnailer"
brew "fx"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-quick-stats"
brew "gnu-tar"
brew "libassuan"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "lazygit"
brew "libfido2"
brew "luv"
brew "miller"
brew "mingw-w64"
brew "mkcert"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node@20"
brew "nvm"
brew "ollama"
brew "openssl@3.0"
brew "pipx"
brew "pngpaste"
brew "pnpm"
brew "poppler"
brew "pre-commit"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ranger"
brew "ripgrep"
brew "ruff"
brew "smartmontools"
brew "socat"
brew "sqlite-analyzer"
brew "sslscan"
brew "syncthing"
brew "telnet"
brew "tesseract-lang"
brew "tmux"
brew "tree"
brew "unar"
brew "universal-ctags"
brew "vhs"
brew "virtualenv"
brew "wasmer"
brew "wtfutil"
brew "xh"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "ariga/tap/atlas"
brew "charmbracelet/tap/freeze"
brew "daipeihust/tap/im-select"
brew "filosottile/musl-cross/musl-cross"
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
brew "tinygo-org/tools/tinygo"
cask "another-redis-desktop-manager"
cask "basictex"
cask "hashicorp-vagrant"
cask "mos"
cask "notion"
cask "raycast"
cask "todesk"
cask "visual-studio-code"
cask "wpsoffice-cn"
vscode "adamhartford.vscode-base64"
vscode "afzalsayed96.icones"
vscode "ahmadalli.vscode-nginx-conf"
vscode "aldijav.golangwithdidi"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "alibaba-cloud.tongyi-lingma"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.iconify"
vscode "antfu.slidev"
vscode "antfu.unocss"
vscode "asvetliakov.vscode-neovim"
vscode "bbenoist.vagrant"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "chaitanyashahare.lazygit"
vscode "charliermarsh.ruff"
vscode "dancheg97.grpc-clicker"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "gera2ld.markmap-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hdevalke.rust-test-lens"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "jaspernorth.vscode-pigments"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "lokalise.i18n-ally"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "natizyskunk.sftp"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "novenn.random-something"
vscode "nuxtr.nuxtr-vscode"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "premparihar.gotestexplorer"
vscode "qiaojie.binary-viewer"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.partial-diff"
vscode "sdras.vue-vscode-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sjhuangx.vscode-scheme"
vscode "stevejpurves.cucumber"
vscode "streetsidesoftware.code-spell-checker"
vscode "swellaby.rust-pack"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "tecosaur.latex-utilities"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "whtouche.vscode-js-console-utils"
vscode "wk-j.save-and-run"
vscode "yeannylam.teo-vscode"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
